# Fina Project - Introduction to Data Science
## Viktor Liviniuk, Alina Liviniuk (Skoltech, 2017)

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
from matplotlib import pyplot as plt

# more attractive color scheme for plots
sns.set()

# set figure appearance in notebook (no pop up)
%matplotlib inline

## Reading and checking out the data

In [2]:
# read the train data from url
file = 'train8002.csv'
train = pd.read_csv(file,  delimiter = ',')
# names=['ID', 'Date', 'Store', 'Item', 'Unit_sales']
train.head(5)

   id        date  store_nbr  item_nbr  unit_sales  onpromotion
0   0  2013-01-01         25    103665         7.0          NaN
1   1  2013-01-01         25    105574         1.0          NaN
2   2  2013-01-01         25    105575         2.0          NaN
3   3  2013-01-01         25    108079         1.0          NaN
4   4  2013-01-01         25    108701         1.0          NaN

In [ ]:
train.info()

In [ ]:
train.describe()

In [3]:
# read the test data from url
file = 'test.csv'
test = pd.read_csv(file,  delimiter = ',')
# names=['ID', 'Date', 'Store', 'Item', 'Unit_sales']
test.head(5)

          id        date  store_nbr  item_nbr  onpromotion
0  125497040  2017-08-16          1     96995        False
1  125497041  2017-08-16          1     99197        False
2  125497042  2017-08-16          1    103501        False
3  125497043  2017-08-16          1    103520        False
4  125497044  2017-08-16          1    103665        False

In [16]:
test.describe()

In [8]:
# read the holidays_events.csv data from url
file = 'holidays_events.csv'
holidays_events = pd.read_csv(file,  delimiter = ',')
# names=['ID', 'Date', 'Store', 'Item', 'Unit_sales']
holidays_events.head(10)
#holidays_events.info()
#holidays_events.describe()

,date,type,locale,locale_name,description,transferred
0,2012-03-02,Holiday,Local,Manta,Fundacion de Manta,False
1,2012-04-01,Holiday,Regional,Cotopaxi,Provincializacion de Cotopaxi,False
2,2012-04-12,Holiday,Local,Cuenca,Fundacion de Cuenca,False
3,2012-04-14,Holiday,Local,Libertad,Cantonizacion de Libertad,False
4,2012-04-21,Holiday,Local,Riobamba,Cantonizacion de Riobamba,False
5,2012-05-12,Holiday,Local,Puyo,Cantonizacion del Puyo,False
6,2012-06-23,Holiday,Local,Guaranda,Cantonizacion de Guaranda,False
7,2012-06-25,Holiday,Regional,Imbabura,Provincializacion de Imbabura,False
8,2012-06-25,Holiday,Local,Latacunga,Cantonizacion de Latacunga,False
9,2012-06-25,Holiday,Local,Machala,Fundacion de Machala,False

In [7]:
# read the items.csv data from url
file = 'items.csv'
items = pd.read_csv(file,  delimiter = ',')
# names=['ID', 'Date', 'Store', 'Item', 'Unit_sales']
items.head(5)
#items.info()
#items.describe()

   item_nbr        family  class  perishable
0     96995     GROCERY I   1093           0
1     99197     GROCERY I   1067           0
2    103501      CLEANING   3008           0
3    103520     GROCERY I   1028           0
4    103665  BREAD/BAKERY   2712           1

In [10]:
# read the oil.csv data from url
file = 'oil.csv'
oil = pd.read_csv(file,  delimiter = ',')
# names=['ID', 'Date', 'Store', 'Item', 'Unit_sales']
oil.head(5)
#oil.info()
#oil.describe()

         date  dcoilwtico
0  2013-01-01         NaN
1  2013-01-02       93.14
2  2013-01-03       92.97
3  2013-01-04       93.12
4  2013-01-07       93.20

In [11]:
# read the sample_submission.csv data from url
file = 'sample_submission.csv'
sample_submission = pd.read_csv(file,  delimiter = ',')
# names=['ID', 'Date', 'Store', 'Item', 'Unit_sales']
sample_submission.head(5)
#sample_submission.info()
#sample_submission.describe()

          id  unit_sales
0  125497040           0
1  125497041           0
2  125497042           0
3  125497043           0
4  125497044           0

In [24]:
sample_submission = sample_submission.drop(['id'], axis=1)

In [25]:
sample_submission.head(5)

   unit_sales
0           0
1           0
2           0
3           0
4           0

In [12]:
# read the stores.csv data from url
file = 'stores.csv'
stores = pd.read_csv(file,  delimiter = ',')
# names=['ID', 'Date', 'Store', 'Item', 'Unit_sales']
stores.head(5)
#stores.info()
#stores.describe()

   store_nbr           city                           state type  cluster
0          1          Quito                       Pichincha    D       13
1          2          Quito                       Pichincha    D       13
2          3          Quito                       Pichincha    D        8
3          4          Quito                       Pichincha    D        9
4          5  Santo Domingo  Santo Domingo de los Tsachilas    D        4

In [13]:
# read the transactions.csv data from url
file = 'transactions.csv'
transactions = pd.read_csv(file,  delimiter = ',')
# names=['ID', 'Date', 'Store', 'Item', 'Unit_sales']
transactions.head(5)
#transactions.info()
#transactions.describe()

         date  store_nbr  transactions
0  2013-01-01         25           770
1  2013-01-02          1          2111
2  2013-01-02          2          2358
3  2013-01-02          3          3487
4  2013-01-02          4          1922

## Drop overclaimers

All column "onpromotion" is empty, so let's delete it

In [ ]:
train = train.drop(['onpromotion'], axis=1)

train.info()

In [17]:
test = test.drop(['onpromotion'], axis=1)

There is no useful info in 'id' column, so I deleted it

In [18]:
test = test.drop(['id'], axis=1)

In [23]:
test.head(5)

         date  store_nbr  item_nbr
0  2017-08-16          1     96995
1  2017-08-16          1     99197
2  2017-08-16          1    103501
3  2017-08-16          1    103520
4  2017-08-16          1    103665

It is needed to add how many items it will be selled. I will add column 'unit_sales' to the test data.

In [26]:
test = pd.concat([test,sample_submission])
test.head(5)

         date  item_nbr  store_nbr  unit_sales
0  2017-08-16   96995.0        1.0         NaN
1  2017-08-16   99197.0        1.0         NaN
2  2017-08-16  103501.0        1.0         NaN
3  2017-08-16  103520.0        1.0         NaN
4  2017-08-16  103665.0        1.0         NaN

## Identifying and splitting input and output variables

In [ ]:
# features
X = train
# targets
y = test

In [ ]:
X.head(5)

In [ ]:
y.head(5)

## Encoding categorical variables

## Visualisalion

In [ ]:
X = train[:, 0]
Y = train[:, 1]

f, ax = plt.subplots(figsize=(5, 5))
ax.plot(X, Y, 'ro', markersize=10)